from fastapi import FastAPI

app = FastAPI()

@app.get("/home/{StudentState}")
def StudentState(StudentState):
    state = str(StudentState)
    allstate = ["قم","مرکزی","تهران","لرستان",
                "همدان","کرمانشاه","ایلام","خوزستان","اصفهان"
                ,"گیلان","آذربایجان غربی","آذربایجان شرقی","آذربایجان","زنجان","قزوین","اردبیل",
                "چهارمحال","کهگیلویه و بویراحمد","کهگیلویه","چهارمحال و بختیاری","بوشهر","البرز","فارس",
                "سمنان","مازندران","گلستان","یزد","خراسان جنوبی","خراسان رضوی","خراسان شمالی",
                'کرمان',"هرمزگان",'سیستان',"سیستان و بلوچستان",'سایر']

    if state not in allstate:
        return "استان وارد شده نادرست است; میتوانید کلمه سایر را وارد کنید"

    return "استان وارد شده صحیح است"


